src/AccumulationRegisters/ЛичныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЛичныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалютная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Доходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Доходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалютная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДвижений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Расходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалютная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДвижений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonForms/ФормаДиаграмм/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьДиаграммыНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммыНаСервере()

	ОбновитьДиаграммуОстаткиПоЛичнымСчетам();
	ОбновитьДиаграммуДоходы();
	ОбновитьДиаграммуРасходы();
	ОбновитьДиаграммуТопПокупок();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуОстаткиПоЛичнымСчетам()

	Диаграмма = ОстаткиПоСчетам;
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛичныеСчетаОстатки.Счет КАК Счет,
	|	ЛичныеСчетаОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЛичныеСчета.Остатки КАК ЛичныеСчетаОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Точка = Диаграмма.Точки.Добавить("Сумма в рублях");
	
	Пока Выборка.Следующий() Цикл
		
		Серия = Диаграмма.УстановитьСерию(Выборка.Счет);
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.СуммаОстаток);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуДоходы()

	Диаграмма = Доходы;
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыОбороты.Период КАК Период,
	|	ДоходыОбороты.СтатьяДвижений КАК СтатьяДвижений,
	|	ДоходыОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Доходы.Обороты(, , Месяц, ) КАК ДоходыОбороты
	|УПОРЯДОЧИТЬ ПО Период ВОЗР";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		ПредставлениеПериода = Формат(Выборка.Период,"ДФ=ММММ.гггг"); 
		
		Точка = Диаграмма.УстановитьТочку(ПредставлениеПериода);
		Серия = Диаграмма.УстановитьСерию(Выборка.СтатьяДвижений);
		
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуРасходы()

	Диаграмма = Расходы;
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыОбороты.Период КАК Период,
	|	РасходыОбороты.СтатьяДвижений КАК СтатьяДвижений,
	|	РасходыОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Расходы.Обороты(, , Месяц, ) КАК РасходыОбороты
	|УПОРЯДОЧИТЬ ПО Период ВОЗР";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		ПредставлениеПериода = Формат(Выборка.Период,"ДФ=ММММ.гггг"); 
		
		Точка = Диаграмма.УстановитьТочку(ПредставлениеПериода);
		Серия = Диаграмма.УстановитьСерию(Выборка.СтатьяДвижений);
		
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуТопПокупок()

	Диаграмма = ТопПокупок;
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыОбороты.Номенклатура КАК Номенклатура,
	|	РасходыОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Расходы.Обороты(&ДатаНачала, , , Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК РасходыОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОборот УБЫВ";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Серия = Диаграмма.Серии.Добавить("Сумма в рублях");
	
	Счетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик > 20 Тогда
			Прервать;
		КонецЕсли;
		
		Точка = Диаграмма.УстановитьТочку(Выборка.Номенклатура);		
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот);
		
		Счетчик = Счетчик + 1; 
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДиаграммыКоманда(Команда)
	
	ОбновитьДиаграммыНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДиаграммыНаКлиенте()

	ОбновитьДиаграммыНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьАвтоматическиПриИзменении(Элемент)
	
	Если ОбновлятьАвтоматически Тогда
		Элементы.ИнтервалОбновленияДиаграмм.Доступность = Истина;
		ПодключитьОбработчикОжидания("ОбновитьДиаграммыНаКлиенте", ИнтервалОбновленияДиаграмм);
	Иначе
		Элементы.ИнтервалОбновленияДиаграмм.Доступность = Ложь;
		ОтключитьОбработчикОжидания("ОбновитьДиаграммыНаКлиенте");
	КонецЕсли;
	
КонецПроцедуры

ИнтервалОбновленияДиаграмм = 5;
